wintersmith/contents/articles/Erlang/2015-01-11-erlang-note.html
---
date: 2015-01-11 19:40:06
template: tech.jade
title: Erlang 语言
category: Erlang
chage_frequency: monthly
tag: Erlang
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">核心概念</a></li>
<li><a href="#sec-2">工具和支持</a></li>
<li><a href="#sec-3">应用场景</a></li>
<li><a href="#sec-4">最佳实践/编程原则</a></li>
<li><a href="#sec-5">学习参考</a></li>
</ul>
</div>
</div>

<p>
Erlang语言，时间上不算新，1987与Perl同岁。为大并发设计，支持热升级，分布式。用于电信系统。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">核心概念</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> 进程 </dt><dd>进程代表一个执行体，进程比较轻量，可以创建非常非常多。每个进程是一个erlang虚拟机。
</dd>
<dt> 消息 </dt><dd>进程通信和交互通过传递消息，除此之外几乎没有共享状态的途径。
</dd>
<dt> 函数式 </dt><dd>FP的特性，如递归、不可变变量，绑定、模式匹配等。
</dd>
<dt> 行为与策略分离 </dt><dd>OTP主张设计原则是行为与策略分离，一个行为可以服务无数多的策略，行为负责那些通用的与业务逻辑无关的部分。
</dd>
<dt> crash </dt><dd>如果进程出错，那么让它Crash推出，而不是捕获异常。其它进程会收到消息，进行响应异常。
</dd>
<dt> ETS/DETS </dt><dd>基于内存和基于磁盘的映射存储。他们可以用来实现数据的存放。
</dd>
<dt> Node </dt><dd>每个Node代表一个Erlang虚拟机集，多个Node实现分布式。
</dd>
<dt> OTP </dt><dd>不是Erlang语言的部分。它定义一个设计规范，以及一些成熟的框架，方便开发稳定健壮的Erlang应用和系统。
</dd>
<dt> 变量 </dt><dd>变量名大写开头
</dd>
<dt> atom </dt><dd>atom 代表了一种类似其它语言常量的东西
</dd>
<dt> port </dt><dd>erlang与其它语言的程序对接，使用port的概念，将其它程序映射为一个进程。通过port进行交互。
</dd>
<dt> Jinterface </dt><dd>java与erlang对接的java库 <a href="http://www.erlang.org/doc/apps/jinterface/jinterface_users_guide.html">Jinterface Package</a>
</dd>
<dt> sasl </dt><dd><ul class="org-ul">
<li>overload —— cpu 使用率控制
</li>
<li>alarm_handler —— alarm 处理接口
</li>
<li>rb —— report browser tool , 查询和浏览report
</li>
<li>release_handler —— release相关的工具和接口
</li>
<li>systools —— 脚本生成、upgrade生成等工具
</li>
</ul>
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">工具和支持</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> rebar </dt><dd>项目管理，类似maven。
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">应用场景</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt> 网络通信 </dt><dd>网络高并发的通信场景下，Erlang有天然优势，毕竟它就是为此设计的。此外，Erlang对于网络数据包的处理非常方便，解包和封包都通过模式匹配很轻松的完成。
</dd>
<dt> 网络应用服务器 </dt><dd>如web游戏，网络应用在线聊天服务器等
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">最佳实践/编程原则</h2>
<div class="outline-text-2" id="text-4">
<p>
此处 ： <a href="http://www.erlang.se/doc/programming_rules.shtml">http://www.erlang.se/doc/programming_rules.shtml</a>
是Erlang 官方提供的编程规范建议，其中的一些建议直接反应了Erlang语言的一些特殊性质，
一些规范是应该严格遵循的，以防止错误和隐患，如：尾递归，进程字典，消息队列堆积
</p>

<p>
一些是建议性的，为了使代码更健壮、易维护、易复用，系统设计更合理和清晰，如：至顶向下的设计步骤，异常使用，单一角色，非防御性编程，一个活动体一个进程，使用进程组件系统，使用server模型，使用函数接口而非消息接口，
</p>

<p>
一些是良好的一致性的习惯，如文档、注释、函数的返回、消息的传递、使用record，消息打标签，避免嵌套，使用小函数，命名规范，无副作用，通用代码抽象成库，库功能单一明确化等。
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">学习参考</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="http://blog.yufeng.info/archives/category/erlang">余峰的erlang研究</a>
</li>
<li>github
</li>
</ul>
</div>
</div>
